{"videos.cba13243-5ad3-4360-87df-6286867c473a": {"annotation_qa": ["Q: Who is C conversing with?\nA: man X0\n\nQ: What is C doing during the conversation?\nA: conversing\n\nQ: Is there any additional information available about the nature of the conversation?\nA: No information is provided about the conversation's nature.", "Q: What does C do during this time period?\nA: C looks at the green vegetables.\n\nQ: What color are the vegetables that C is looking at?\nA: green.", "Q: Who is cutting vegetables on the chair?\nA: C\n\nQ: What is C using to cut the vegetables?\nA: her hands", "Q: What does C do?\nA: C drops the vegetable on the chair with other vegetables.\nQ: What does C drop?\nA: C drops the vegetable.\nQ: Where does C drop the vegetable?\nA: C drops the vegetable on the chair.", "Q: What does C do?\nA: C separates green vegetables from their stalks.\n\nQ: What color are the vegetables that C separates?\nA: green\n\nQ: What part of the vegetable does C separate?\nA: their stalks\n\nStart Time: 13.831647199999999 End Time: 13.831647199999999", "Q: What does C do?\nA: C picks a vegetable from a bunch of vegetables.\nQ: What does the vegetable look like?\nA: There is no information provided about the appearance of the vegetable.\nQ: Where does C pick the vegetable from?\nA: It is implied that C picks the vegetable from a bunch of vegetables, but no specific location is mentioned.\nStart time: 14.5081572 End time: 14.5081572", "Q: What does C do?\n        A: C cuts the vegetable with her hands\n\n        Q: How does C cut the vegetable?\n        A: with her hands", "Q: What does C do during the video?\nA: C drops the vegetable on the chair with other vegetables. - 17.110057200000004 to 17.110057200000004\n\nQ: What does C drop on the chair?\nA: The vegetable. - 17.110057200000004 to 17.110057200000004\n\nQ: Where does C drop the vegetable?\nA: On the chair. - 17.110057200000004 to 17.110057200000004.", "Q: Who picks a vegetable from the bunch of vegetables?\nA: C\n(start_time: 18.425877200000002 end_time: 18.425877200000002)", "Q: Who cuts the vegetable?\nA: C\n\nQ: How does C cut the vegetable?\nA: with her hands\n\nQ: What does C cut?\nA: the vegetable\n\nstart_time: 19.617977200000002 end_time: 19.617977200000002", "Q: What is happening in the video during the given time slot?\nA: During the given time slot, #C drops a vegetable on the chair with other vegetables.\n\nQ: Who is dropping the vegetable?\nA: #C is dropping the vegetable.\n\nQ: Where is the vegetable dropped?\nA: The vegetable is dropped on the chair.\n\nQ: Are there other vegetables present when #C drops the vegetable?\nA: Yes, there are other vegetables present on the chair when #C drops the vegetable.", "Q: What does C do?\nA: C throws dirt on the floor.\nQ: What does C throw on the floor?\nA: dirt.", "Q: Who picks a vegetable from the bunch?\nA: C\n\nQ: What does C pick from the bunch?\nA: a vegetable\n\nQ: How many vegetables does C pick from the bunch?\nA: It is not specified in the description.\n\n start_time: 24.096737200000003 end_time: 37.4130129 description: #C C brings the vegetable to the cutting board and starts to chop it. \n\nQ: Where does C bring the vegetable?\nA: to the cutting board\n\nQ: What does C do to the vegetable?\nA: C starts to chop it.\n\nQ: What does C use to chop the vegetable?\nA: It is not specified in the description.\n\n start_time: 37.4130129 end_time: 43.582331499999996 description: #C C takes a frying pan and puts something in it.\n\nQ: What does C take?\nA: a frying pan\n\nQ: What does C put in the frying pan?\nA: something\n\nQ: What does C do with the frying pan after putting something in it?\nA: It is not specified in the description.\n\n start_time: 43.582331499999996 end_time: 61.5908994 description: #C C stirs the ingredients in the frying pan.\n\nQ: What does C stir?\nA: the ingredients\n\nQ: Where does C stir the ingredients?\nA: in the frying pan\n\nQ: Does C stop stirring at any point during this time period?\nA: It is not specified in the description.\n\n start_time: 61.5908994 end_time: 70.93156399999999 description: #C C puts the cooked food on a plate.\n\nQ: What does C put on a plate?\nA: the cooked food\n\nQ: Where does C put the cooked food?\nA: on a plate\n\nQ: Does C add any garnish or sauce to the cooked food?\nA: It is not specified in the description.", "Q: Who cuts the vegetable?\nA: C\n\nQ: How does C cut the vegetable?\nA: with her hands\n\nQ: What does C cut?\nA: the vegetable\n- start_time: 25.988077200000003 end_time: 25.988077200000003", "Q: What does C do?\n  A: C drops the vegetable on the chair with other vegetables. (28.2100572-28.2100572)\n\n  Q: What does C drop?\n  A: The vegetable. (28.2100572-28.2100572)\n\n  Q: Where does C drop the vegetable?\n  A: On the chair. (28.2100572-28.2100572)", "Q: What does C do during this time period?  \nA: C throws dirt on the floor.", "Q: Who picks a vegetable?\nA: C\n\nQ: What does C pick?\nA: a vegetable\n\nQ: From where does C pick the vegetable?\nA: from the bunch of vegetables.\n\nStart time: 29.0375872  End time: 29.0375872", "Q: Who cuts the vegetable?\nA: C\n\nQ: How does C cut the vegetable?\nA: with her hands\n\nQ: What does C cut?\nA: the vegetable\n       \n(start_time: 29.929777200000004 end_time: 29.929777200000004)", "Q: What does C do?\nA: C drops the vegetable on the chair with other vegetables.\n\nQ: What did C drop?\nA: The vegetable.\n\nQ: Where did C drop the vegetable?\nA: On the chair.", "Q: Who picks a vegetable from the bunch of vegetables?\nA: C\n\nQ: What does C pick?\nA: a vegetable\n\nQ: From where does C pick the vegetable?\nA: the bunch of vegetables\n\nstart_time: 32.092317200000004 end_time: 32.092317200000004"], "summary_qa": ["Q: Where was C during this time period?\nA: C was in the kitchen. 3240.021028645833 - 3540.021028645833 \n\nQ: What did C cook during this time period?\nA: C cooked naan. 3240.021028645833 - 3540.021028645833 \n\nQ: Did C wear the sleeve up or down?\nA: C pulled the sleeve up. 3240.021028645833 - 3540.021028645833 \n\nQ: What happened in the kitchen during this time period?\nA: The provided information does not give any details about events that took place in the kitchen during this time period.", "Q: What was C doing in the kitchen during this time period?  \nA: C was rolling dough with a rolling pin and using a skimmer to cook roti in the frying pan. #Summary start_time: 3240.021028645833 end_time: 3540.021028645833", "Q: Where was C during the video?\nA: C was in a room.  Start_time: 2700.021028645833 End_time: 3000.021028645833.\n\nQ: What did C do with the firewood?\nA: C adjusted the firewood. Start_time: 2700.021028645833 End_time: 3000.021028645833.\n\nQ: What did C do with the dough?\nA: C kneaded the dough, then later rolled it with a rolling pan. Start_time: 2700.021028645833 End_time: 3000.021028645833.", "Q: Who was in the room during this time?\n  A: C\n\nQ: What did C do during this time?\n  A: C rolled dough and cooked roti\n\nQ: Was C alone in the room?\n  A: Cannot determine from given information.\n\nStart time: 2970.021028645833 end time: 3270.021028645833", "Q: What did C do at the beginning of the video?\nA: C lit the fire.\n\nQ: What did C fetch after lighting the fire?\nA: C fetched some water from a water pump.\n\nQ: What did C do after fetching water?\nA: C winnowed some cereals in the room.\n\nQ: Where did C get the water from?\nA: from a water pump\n\nQ: What did C do with the cereals?\nA: C winnowed them\n\nQ: Was the winnowing done in the room?\nA: Yes, it was done in the room.\n\nQ: Was the fire lit before or after the cereals were winnowed?\nA: The fire was lit before the cereals were winnowed. \n\nQ: Did C fetch water before or after lighting the fire?\nA: C fetched water after lighting the fire.\n\nQ: Q: What did C do after winnowing the cereals?\nA: We don't know as the description ends there.", "Q: Where was C?\nA: C was in a room.\n\nQ: What did C do with the dough?\nA: C rolled the dough with the rolling pin.\n\nQ: What did C do with the dough after rolling it?\nA: C dipped them inside the oil.\n\nQ: Who did C converse with?\nA: C conversed with person P0.\n\nQ: What is the overall description of this time period?\nA: This time period is a summary. \n\nStart Time: 2970.021028645833 \nEnd Time: 3270.021028645833", "Q: Where was C located during this time period?\nA: C was in the kitchen.\n\nQ: What did C do with the rice?\nA: C winnowed the rice on a tray.\n\nQ: What did C do with the rolling pin?\nA: C rolled dough with the rolling pin.\n\nStart time: 2700.021028645833\nEnd time: 3000.021028645833", "Q: Who was in the kitchen with C?\nA: woman P\n\nQ: What did C use to make the deep-fried African donut?\nA: rolling pin, draining spoon, saucepan, and frying pan\n\nQ: What was C making in the kitchen with woman P?\nA: deep-fried African donut\n\nQ: What tools did C use to make the deep-fried African donut?\nA: rolling pin, draining spoon, saucepan, and frying pan\n\nQ: What type of donut did C make in the kitchen?\nA: deep-fried African donut", "Q: Where was C?\nA: C was in a kitchen.\n\nQ: What was beside C?\nA: A fire was beside C.\n\nQ: How did C prepare the fire?\nA: C prepared the fire with cow dung charcoal.\n\nQ: What did C do with the cooking pot?\nA: C pumped water into the cooking pot.\n\nQ: What did C sieve with a tray?\nA: C sieved rice with a tray.\n\nFinal QA pair: \nQ: What tasks did C perform in the kitchen? \nA: C sat beside a fire, prepared the fire with cow dung charcoal, pumped water into a cooking pot, and sieved rice with a tray. (start_time: 2430.021028645833 end_time: 2730.021028645833)", "Q: Who was C interacting with in the yard?\nA: a man X and a Boy Y\n(start_time: 5293.287695266667 end_time: 5316.487695266666)\n\nQ: Where does the interaction between C, man X, and Boy Y take place?\nA: in a yard\n(start_time: 5293.287695266667 end_time: 5316.487695266666)\n\nQ: What is the summary of the scene?\nA: C was in a yard, she interacted with a man X and a Boy Y.\n(start_time: 5293.287695266667 end_time: 5316.487695266666)", "Q: Where was C located?\nA: C was in the kitchen room. 5293.287695266667-5316.487695266666.\n\nQ: What did C place in the fire?\nA: C placed cow dung in the fire to light the fire. 5293.287695266667-5316.487695266666. \n\nQ: Who did C interact with?\nA: The description does not provide information on who C interacted with. 5293.287695266667-5316.487695266666.", "Q: Who does C interact with in the kitchen?\nA: C interacted with a man X.\n\nQ: What did C do in the kitchen?\nA: C cooked and put charcoal in a fire wood stove.\n\nQ: Where did C cook?\nA: in the kitchen\n\nQ: What did C put in the fire wood stove?\nA: charcoal\n\nQ: What is the name of the man C interacted with?\nA: The name of the man is X.\n\nQ: During what time period did C interact with X in the kitchen?\nA: C interacted with X in the kitchen from 5293.287695266667 to 5316.487695266666.", "Q: Who sat in the room?\nA: C sat in the room.\n\nQ: What did C do in the room?\nA: C broke cooking stones and put them on fire, pulled pullover on right arm and left arm and stared around.\n\nQ: Where did C put the cooking stones?\nA: C put the cooking stones on fire.\n\nQ: What did C do with the pullover?\nA: C pulled the pullover on both arms.\n\nQ: Did C interact with anything in the room?\nA: There is no information provided in the description about C interacting with anything in the room. \n\nStart time: 5293.287695266667 \nEnd time: 5316.487695266666", "Q: Where was C at the beginning of the video?\nA: C was in the kitchen. 5293.287695266667 5316.487695266666\n\nQ: What did C do in the kitchen?\nA: C took the wood and put it in the wood stove. 5293.287695266667 5316.487695266666\n\nQ: Who did C speak with in the kitchen?\nA: C spoke with man X0. 5293.287695266667 5316.487695266666\n\nQ: Did C use the wood stove?\nA: Yes, C put the wood in the wood stove. 5293.287695266667 5316.487695266666", "Q: Who was in the room?\nA: C\nQ: What did C do?\nA: C put dung fuel in the fire\nStart time: 5293.287695266667 End time: 5316.487695266666", "Q: Who put pieces of fire wood in the fire place?\nA: C\n\nQ: What did C put in the fire place?\nA: pieces of fire wood\n\nQ: Where did C put the fire wood?\nA: in the fire place\n\nStart time: 5293.287695266667 End time: 5316.487695266666", "Q: Where was C?\nA: C was in the kitchen. - 5293.287695266667 5316.487695266666\n\nQ: What did C do in the kitchen?\nA: C cut the cow dung and pushed it inside the traditional mud stove. - 5293.287695266667 5316.487695266666\n\nQ: Who did C talk to?\nA: C talked to man X0. - 5293.287695266667 5316.487695266666", "Q: Where was C?\nA: C was in a room. 5293.287695266667-5316.487695266666\n\nQ: What was C doing in the room?\nA: C was sitting beside the fire. 5293.287695266667-5316.487695266666\n\nQ: What did C put in the fire?\nA: It is unsure what C put in the fire. 5293.287695266667-5316.487695266666\n\nQ: What did C do while adjusting her sweater?\nA: C put something in the fire while adjusting her sweater. 5293.287695266667-5316.487695266666", "Q: Who is Summary talking to while putting charcoal in the fire?\nA: person X0\nStart Time: 5293.287695266667 End Time: 5316.487695266666", "Q: What did C put in the fire?\nA: C put cow dung in the fire.\n\nQ: Did C interact with anyone during this time period?\nA: Yes, C interacted with other people.\n\nStart Time: 5293.287695266667 \nEnd Time: 5316.487695266666"]}}